intern-middleware/src/main/resources/inputXML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="urn:SubscriberService/message/">
    <soapenv:Header>
        <AuthHeader>
            <userName>admin</userName>
            <password>PBkslw76</password>
        </AuthHeader>
    </soapenv:Header>
    <soapenv:Body>
        <mes:SAMORequest>
            <mes:routerName>06CevizlidereRALU01</mes:routerName>
            <mes:userIP>?</mes:userIP>
            <mes:routerIP>?</mes:routerIP>
        </mes:SAMORequest>
    </soapenv:Body>
</soapenv:Envelope>
